In [1]:
import pandas as pd

In [19]:
df_n = pd.DataFrame({'s1':[1,2,3,4,5,6],'s2':[5,6,7,8,9,11]})

In [20]:
df_n

   s1  s2
0   1   5
1   2   6
2   3   7
3   4   8
4   5   9
5   6  11

In [6]:
df['s1'] = df.s1.map(lambda x: x+2)

In [9]:
df = pd.read_csv('https://raw.githubusercontent.com/zekelabs/machine-learning-for-beginners/master/data/titanic-train.csv',index_col='PassengerId')

### Add 10 to male's age & subtract 10 from female's age

In [12]:
def ageModifier(r):
    return r + 10

df.Age = df.Age.map(ageModifier)

In [18]:
def ageModifierBySex(r):

    if r['Sex'] == 'male':
        return r['Age'] + 10

    else:
        return r['Age'] - 10
    
df['Age'] = df.apply(ageModifierBySex, axis=1)

In [24]:
df_n

   s1  s2
0   1   5
1   2   6
2   3   7
3   4   8
4   5   9
5   6  11

In [22]:
df_n.apply(lambda x: sum(x),axis=1)

0     6
1     8
2    10
3    12
4    14
5    17
dtype: int64

In [23]:
df_n.apply(lambda x: sum(x),axis=0)

s1    21
s2    46
dtype: int64

In [25]:
df_n.agg({'s1':lambda x:x+2,'s2':lambda y:y-2})

   s1  s2
0   3   3
1   4   4
2   5   5
3   6   6
4   7   7
5   8   9

In [28]:
df_n.agg({'s1':lambda x:x.min(),'s2':lambda y:y.max()},axis=0)

s1     1
s2    11
dtype: int64

In [29]:
df_n

   s1  s2
0   1   5
1   2   6
2   3   7
3   4   8
4   5   9
5   6  11

In [30]:
df_n.applymap(lambda x:x*2)

   s1  s2
0   2  10
1   4  12
2   6  14
3   8  16
4  10  18
5  12  22